early-init.org
#+title: Emacs Early Init
#+author: mattiasdrp
#+date: <2022-08-17 Wed>
#+language: en_US
#+property: header-args :results silent :exports code :tangle yes

#+keywords: Emacs

Literate configuration for [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html][early-init.el]].

:PROPERTIES:
:TOC:      :include all
:END:

:CONTENTS:

:END:

* Header

#+begin_src emacs-lisp
  ;;; early-init.el --- Emacs early init -*- lexical-binding: t -*-
  ;;

  ;; Copyright (c) 2022 mattiasdrp and contributors.

  ;; Author: mattiasdrp
  ;; Maintainer: mattiasdrp <https://github.com/mattiasdrp>
  ;; Created: 17 august 2022
  ;; Version: 1.0
  ;; Licence: MIT
  ;; Keywords: emacs, init, convenience, configuration
  ;; URL: https://github.com/mattiasdrp/pokemacs

  ;;; Commentary:

  ;; This file is an early-init file for Emacs. It will be executed before
  ;; init.el when emacs is loaded.

  ;; This file IS NOT intended to be edited! It was generated by early-init.org.
  ;; If you want to change it, edit early-init.org then M-x org-babel-tangle

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; Code:

#+end_src

* Decrease GC frequency

By increasing the GC threshold we ensure that it will run less frequently and thus lead to a faster start-up.

#+begin_src emacs-lisp
  (setq gc-cons-threshold 100000000)
#+end_src

* Increase data read from processes

This is useful for lsp, notably

#+begin_src emacs-lisp
  (setq read-process-output-max (* 1024 1024)) ;; 1mb
#+end_src

* Prevent Unwanted Runtime Compilation

Prevent extra unnecessary runtime compilation for gccemacs. This idea came from the Doom Emacs early-init.el file.

#+begin_src emacs-lisp
  (setq native-comp-deferred-compilation nil)
#+end_src

* Disable package-enable-at-startup

Package initialize occurs automatically, before init.el is loaded, but after early-init.el. We handle package initialization, so we must prevent Emacs from doing it early.

#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src

* Reduce Redisplay

To reduce slowdowns caused by early redisplays when loading, the following code will reduce the amount of times Emacs redisplays when setting up windows. This idea came from the Doom Emacs early-init.el file.

#+begin_src emacs-lisp
  (setq-default inhibit-redisplay t
                inhibit-message t)

  (add-hook 'window-setup-hook
            (lambda ()
              (setq-default inhibit-redisplay nil
                            inhibit-message nil)
              (redisplay)))
#+end_src

* Unset file-name-handler-alist

Every file opened and loaded by Emacs will run through this list to check for a proper handler for the file, but during startup, it won’t need any of them.

#+begin_src emacs-lisp
  (defvar file-name-handler-alist-original file-name-handler-alist)
  (setq file-name-handler-alist nil)
#+end_src

* Disable site-run-file

#+begin_src emacs-lisp
  (setq site-run-file nil)
#+end_src

* Disable Unnecessary Interface

It will be faster to disable them here before they've been initialized.

#+begin_src emacs-lisp
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-mode . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
#+end_src

* End

#+begin_src emacs-lisp
  (provide 'early-init)
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; early-init.el ends here
#+end_src
